Revit 2027 API
BuiltInFailures.ImportFailures.ImportTooFarAway Property
 Imported objects located a large distance from the model might not display properly. The 'Center-to-Center' option will be used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ImportTooFarAway { get; }
Public Shared ReadOnly Property ImportTooFarAway As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ImportTooFarAway {
	FailureDefinitionId^ get ();
}
static member ImportTooFarAway : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace